Repository: dev-faysalahmed/Crafty-Bay
Catalog: lib/l10n/app_*.arb
Languages: de

# signUpTitle
source: Sign Up
de: Registrieren

# signUpSubTitle
source: Get started with your details
de: Starten Sie mit Ihren Angaben

# signUpTEFFirstName
source: First Name
de: Vorname

# signUpTEFLastName
source: Last Name
de: Nachname

# signUpTEFPassword
source: Password
de: Passwort

# signUpTEFPhone
source: Phone
de: Telefonnummer

# signUpTEFCity
source: City
de: Stadt

# signUpFilledButtonText
source: Sign Up
de: Registrieren

# signUpAlreadyAccountText
source: Already have an account?
de: Haben Sie bereits ein Konto?

# signUpTextButtonText
source: Sign In
de: Anmelden

# signUpFirstNameValidator
source: Enter your first name
de: Bitte geben Sie Ihren Vornamen ein

# signUpLastNameValidator
source: Enter your last name
de: Bitte geben Sie Ihren Nachnamen ein

# signUpEmailValidator
source: Enter a valid email
de: Bitte eine gültige E-Mail-Adresse eingeben

# signUpPasswordValidator
source: Enter a password
de: Bitte ein Passwort eingeben

# signUpPasswordValidator6Digit
source: Enter minimum 6 digit password
de: Bitte ein Passwort mit mindestens 6 Zeichen eingeben

# signUpPhoneValidator
source: Enter a phone number
de: Bitte eine Telefonnummer eingeben

# signUpCityValidator
source: Enter your city
de: Bitte geben Sie Ihre Stadt ein

# signInTitle
source: Sign In
de: Anmelden

# signInSubTitle
source: Login your account with email and password
de: Melden Sie sich mit E-Mail und Passwort an

# signInTEFPassword
source: Password
de: Passwort

# signInFilledButtonText
source: Sign In
de: Anmelden

# signInNeedAnAccountText
source: Need an Account?
de: Noch kein Konto?

# signInTextButtonText
source: Sign Up
de: Registrieren

# signInEmailValidator
source: Enter a valid email
de: Bitte eine gültige E-Mail eingeben

# signInPasswordValidator
source: Enter a password
de: Bitte ein Passwort eingeben

# signInPasswordValidator6Digit
source: Enter minimum 6 digit password
de: Bitte ein Passwort mit mindestens 6 Zeichen eingeben

# otpVerificationTitle
source: Enter OTP Code
de: OTP-Code eingeben

# otpVerificationSubTitle
source: A 4 digit otp code has been sent
de: Ein 4-stelliger OTP-Code wurde gesendet

# otpVerificationFilledButtonText
source: Next
de: OTP bestätigen

# otpVerificationTextButtonText
source: Resend Code
de: Code erneut senden
